# Use `brew bundle` to install the packages listed below

# Command line tools, utilities and languages
brew "coreutils"
brew "findutils"

brew "bash"
brew "curl"
brew "grep"
brew "gpg"
brew "gawk"
brew "less"
brew "tree"
brew "vim"
brew "wget"
brew "whois"

brew "gzip"
brew "unzip"
brew "xz"

brew "md5sha1sum"
brew "openssl"
brew "ssh-copy-id"
brew "rsync"

brew "jq"
brew "gh"

# asdf runtime version manager
# @see https://asdf-vm.com/guide/getting-started.html
brew "asdf", postinstall: "${HOMEBREW_PREFIX}/bin/asdf plugin add nodejs && ${HOMEBREW_PREFIX} plugin add python"

# ZSH Plugins and shell
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "starship"
brew "zoxide"

# Apps
cask "brave-browser"
cask "discord"
cask "iterm2"
cask "mongodb-compass"
cask "ngrok"
cask "notion"
cask "raycast"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"

# Fonts
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-code-nerd-font"

# Appstore apps
mas "1Password", id: 443987910
